DiplomD/src/Catalogs/СписокСтудентов/СписокСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СписокСтудентов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбразовательнаяПрограмма</name>
    <type>
      <types>CatalogRef.ОбразовательныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетнаяКнижка</name>
    <type>
      <types>DocumentRef.ЗачетнаяКнижкаСтудента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбразования</name>
    <type>
      <types>CatalogRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Documents/ЗачетнаяКнижкаСтудента/ЗачетнаяКнижкаСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачетнаяКнижкаСтудента</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАттестационныхДисцилин</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДисциплины</name>
      <type>
        <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перезачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийСеместровыйРейтинг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Catalogs/ОбразовательныеПрограммы/ОбразовательныеПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбразовательныеПрограммы</name>
  <attributes>
    <name>УровеньОбразования</name>
    <type>
      <types>CatalogRef.УровниОбразования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрофилиНаправления</name>
    <attributes>
      <name>ПрофилиНаправления</name>
      <type>
        <types>CatalogRef.ПрофилиНаправления</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеФормыОбучения</name>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>CatalogRef.ФормыОбучения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DiplomD/src/Catalogs/Группы/Группы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Группы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кафедра</name>
    <type>
      <types>CatalogRef.Кафедры</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразовательнаяПрограмма</name>
    <type>
      <types>CatalogRef.ОбразовательныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбразования</name>
    <type>
      <types>CatalogRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодНачалаОбучения</name>
    <type>
      <types>EnumRef.ГодНачалаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Catalogs/СписокСтудентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПрофильНаправленияПриИзмененииНаСервере()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбразовательныеПрограммыПрофилиНаправления.НомерСтроки КАК НомерСтроки,
	               |	ОбразовательныеПрограммыПрофилиНаправления.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ОбразовательныеПрограммы.ПрофилиНаправления КАК ОбразовательныеПрограммыПрофилиНаправления
	               |ГДЕ
	               |	ОбразовательныеПрограммыПрофилиНаправления.ПрофилиНаправления = &ПрофилиНаправления
	               |	И ОбразовательныеПрограммыПрофилиНаправления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ПрофилиНаправления",Объект.ПрофильНаправления); 
	Запрос.УстановитьПараметр("Ссылка",Объект.ОбразовательнаяПрограмма); 
	Рез = Запрос.Выполнить().Выбрать(); 
	рез.Следующий(); 
	Если ПустаяСтрока(рез.Ссылка) тогда 
		Сообщить("Выбарнный профиль специальности не относится к образовательной программе" + " " + Объект.ОбразовательнаяПрограмма); 
		Объект.ПрофильНаправления = "";  
	Иначе 
		Спр= Справочники.ПрофилиНаправления.НайтиПоНаименованию(Объект.ПрофильНаправления); 
		Объект.УровеньОбразования = Спр.УровеньОбразования; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильНаправленияПриИзменении(Элемент)
	ПрофильНаправленияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаПриИзмененииНаСервере()
	Спр = Справочники.Группы.НайтиПоНаименованию(Объект.Группа);
	Объект.ОбразовательнаяПрограмма = Спр.ОбразовательнаяПрограмма;
	Объект.ПрофильНаправления = Спр.ПрофильНаправления;
	Объект.ФормаОбучения = Спр.ФормаОбучения;
	Объект.УровеньОбразования = Спр.УровеньОбразования;
	Объект.Курс = Спр.Курс;
	Объект.СрокОбучения = Спр.СрокОбучения;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	ГруппаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьИСоздатьЗачетнуюКнижкуНаСервере()
	Если ПустаяСтрока(Объект.Код) Тогда 
		Сообщить("Необходимо записать и провести документ"); 
	Иначе 
		
	запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗачетнаяКнижкаСтудента.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗачетнаяКнижкаСтудента КАК ЗачетнаяКнижкаСтудента
	               |ГДЕ
	               |	ЗачетнаяКнижкаСтудента.Студент = &Студент
	               |	И ЗачетнаяКнижкаСтудента.Группа = &Группа";
	Запрос.УстановитьПараметр("Студент",Объект.Ссылка); 
	Запрос.УстановитьПараметр("Группа",Объект.Группа); 
	Рез = Запрос.Выполнить().Выбрать(); 
	Рез.Следующий(); 
	Если НЕ ПустаяСтрока(Рез.Ссылка) Тогда 
		Сообщить("ранее был создан документ зачетной книжки для студента (ки)" + " " + Объект.Ссылка); 
	Иначе 
		Док = Документы.ЗачетнаяКнижкаСтудента.СоздатьДокумент(); 
		Док.Дата = ТекущаяДата(); 
		Док.Студент = Объект.Ссылка; 
		Док.Группа = Объект.Группа; 
		Док.НомерЗачетнойКнижки = Объект.Код; 
		Док.ПрофильНаправления = Объект.ПрофильНаправления; 
		Попытка 
			Док.Записать(РежимЗаписиДокумента.Запись); 
			Док.Записать(РежимЗаписиДокумента.Проведение); 
			Сообщить("Создан документ зачетной книжки для студента (ки)" + " " + Объект.Ссылка); 
			Объект.НомерЗачетнойКнижки = Объект.Код; 
			Объект.ЗачетнаяКнижка = Док.Ссылка; 
			Объект.СтатусЗачисления= Истина; 
		Исключение 
			Сообщить("Документ зачетной книжки НЕ создан"); 
		КонецПопытки; 
	КонецЕсли; 
КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИСоздатьЗачетнуюКнижку(Команда)
	ЗарегистрироватьИСоздатьЗачетнуюКнижкуНаСервере();
КонецПроцедуры
